lvx/base/Catalogs/бит_БотыTelegram.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_БотыTelegram</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НуженПинКод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбслуживатьЧаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_ЧатыTelegram.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ЧатыTelegram</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_БотыTelegram</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусРегистрацииТелеграм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеКоманды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КомандаТелеграм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_КомандыБотуТелеграм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_БотыTelegram/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция проверяет токен бота.
//
// Параметры:
//  Токен - Строка.
//
// Возвращаемое значение:
//  Структура - результат проверки подключения.
//
Функция ПроверитьТокен(Токен) Экспорт
	
	СтрРезультат = Новый Структура("Существует, Сообщение", Ложь, "");
	
	Если НЕ ЗначениеЗаполнено(Токен) Тогда
		
		СтрРезультат.Сообщение = НСтр("ru='Токен незаполнен.';en='Token unfilled.'"); 
		
	Иначе	
		
		ИмяМетода 		= СтрШаблон("bot%1/getMe", Токен);
		НастройкиПрокси = бит_ТелеграмПовтИсп.НастройкиПрокси();		
		Соединение 		= бит_ТелеграмСервер.НовоеHTTPСоединение();
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("ContentType", "application/json");
		ВебЗапрос = Новый HTTPЗапрос(ИмяМетода, Заголовки);
		
		ВебОтвет = Соединение.Получить(ВебЗапрос);
		
		Если ВебОтвет.КодСостояния = 200 Тогда			
			СтрРезультат.Существует = Истина;
		Иначе	
			СтрРезультат.Сообщение = СтрШаблон(НСтр("ru='КодСостояния: %1, ответ сервера: %2';
													|en='KodSostoyaniya: %1, the server’s response: %2'"), 
									 			ВебОтвет.КодСостояния, 
												ВебОтвет.ПолучитьТелоКакСтроку());
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат СтрРезультат;
	
КонецФункции // ПроверитьТокен()

// Функция получает информацию о сообщениях боту.
//
// Параметры:
//  Бот - СправочникСсылка.бит_БотыTelegram - Бот, для которого выполняется поиск чатов.
//
// Возвращаемое значение:
//  Структура - результат поиска.
//
Функция НайтиЧаты(Бот) Экспорт
	
	Токен = Бот.Токен;
	
	СтрРезультат = Новый Структура("Выполнено, Сообщение, Данные", Ложь, "", Новый Массив);
	
	Если НЕ ЗначениеЗаполнено(Токен) Тогда
		
		СтрРезультат.Сообщение = НСтр("ru='Токен незаполнен.';en='Token unfilled.'"); 
		
	Иначе	
		
		ИмяМетода 		= СтрШаблон("bot%1/getUpdates", Токен);		
		НастройкиПрокси = бит_ТелеграмПовтИсп.НастройкиПрокси();
		Соединение 		= бит_ТелеграмСервер.НовоеHTTPСоединение();
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("ContentType", "application/json");
		ВебЗапрос = Новый HTTPЗапрос(ИмяМетода, Заголовки);
		
		ВебОтвет = Соединение.Получить(ВебЗапрос);
		
		Если ВебОтвет.КодСостояния = 200 Тогда
			
			СтрРезультат.Выполнено = Истина;
			СтрРезультат.Сообщение = ВебОтвет.ПолучитьТелоКакСтроку(); 
			
			Чтение = Новый ЧтениеJSON();
			Чтение.УстановитьСтроку(СтрРезультат.Сообщение);
			
			ДанныеВрем = ПрочитатьJSON(Чтение);	
			
			СтрРезультат.Данные = РазобратьДанныеЧатов(ДанныеВрем, Бот);
			
		Иначе	
			
			СтрРезультат.Сообщение = СтрШаблон(НСтр("ru='КодСостояния: %1, ответ сервера: %2';
													|en='KodSostoyaniya: %1, the server’s response: %2'"), 
									 			ВебОтвет.КодСостояния, 
												ВебОтвет.ПолучитьТелоКакСтроку());
												
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат СтрРезультат;
	
КонецФункции

#КонецОбласти 
	
#Область СлужебныеПроцедурыИФункции

// Функция разбирает данные чатов.
//
// Параметры:
//  ВходящиеДанные - Структура.
//  Бот            - СправочникСсылка.бит_БотыTelegram.
//
// Возвращаемое значение:
//  Массив - данные чатов.
//
Функция РазобратьДанныеЧатов(ВходящиеДанные, Бот, ТолькоНовые = Истина)
	
	ОбработанныеИД = Новый Соответствие;
	ДанныеЧатов = Новый Массив;
	
	Если ТипЗнч(ВходящиеДанные) = Тип("Структура") И ВходящиеДанные.Свойство("result") Тогда
		
		Для каждого ЭлементРезультат Из ВходящиеДанные.result Цикл
			
			Если НЕ ЭлементРезультат.Свойство("message") Тогда
				Продолжить;
			КонецЕсли;
			
			ЧатИнфо = ЭлементРезультат.message.chat;
			ПодготовитьСтруктуруЧата(ЧатИнфо);
			
			Если ОбработанныеИД[ЧатИнфо.id] <> Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			
			ОбработанныеИД.Вставить(ЧатИнфо.id, Истина);
			
			СтруктураЧата = Справочники.бит_ЧатыTelegram.ДанныеЧатаПоИдентификатору(ЧатИнфо.id, Бот);
			ЭтоНовыйЧат   = НЕ ЗначениеЗаполнено(СтруктураЧата.Чат);
			
			Если ТолькоНовые И НЕ ЭтоНовыйЧат Тогда
				Продолжить;
			КонецЕсли; 
			
			ПараметрыЧата = ОпределитьПараметрыЧата(ЧатИнфо);
			
			ДанныеЧата = Новый Структура;
			ДанныеЧата.Вставить("ЭтоНовый"	  , ЭтоНовыйЧат);
			ДанныеЧата.Вставить("Чат"		  , СтруктураЧата.Чат);
			ДанныеЧата.Вставить("ИД"		  , ЧатИнфо.id);
			ДанныеЧата.Вставить("Пользователь", ПараметрыЧата.Пользователь);
			ДанныеЧата.Вставить("Наименование", ПараметрыЧата.Наименование);
			
			ДанныеЧатов.Добавить(ДанныеЧата);
			
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат ДанныеЧатов;
	
КонецФункции

Функция ОпределитьПараметрыЧата(ЧатИнфо)
	
	Параметры = Новый Структура("Пользователь, Наименование"); 
	
	КлючиПоиска      = Новый Массив(); 
	КлючиПоиска.Добавить(ЧатИнфо.username);
	
	Если ЧатИнфо.Свойство("last_name") Тогда
	
		КлючиПоиска.Добавить(ЧатИнфо.last_name);
		КлючиПоиска.Добавить(ЧатИнфо.last_name + " " + ЧатИнфо.first_name);
		
	КонецЕсли; 
	
	Для каждого Значение Из КлючиПоиска Цикл
		Если ЗначениеЗаполнено(Значение) Тогда
			Если НЕ ЗначениеЗаполнено(Параметры.Наименование) Тогда
			     Параметры.Наименование = Значение;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Параметры;

КонецФункции

Процедура ПодготовитьСтруктуруЧата(ЧатИнфо)

	СтруктураПоУмолчанию = Новый Структура(); 
	СтруктураПоУмолчанию.Вставить("id"		  , 0);
	СтруктураПоУмолчанию.Вставить("username"  , "");
	СтруктураПоУмолчанию.Вставить("last_name" , "");
	СтруктураПоУмолчанию.Вставить("first_name", "");
	
	Если ТипЗнч(ЧатИнфо) <> Тип("Структура") Тогда
		ЧатИнфо = Новый Структура(); 
	КонецЕсли;
	
	Для каждого КлючЗначение Из СтруктураПоУмолчанию Цикл
		Если НЕ ЧатИнфо.Свойство(КлючЗначение.Ключ) Тогда
			ЧатИнфо.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры
 
#КонецОбласти

#КонецЕсли
